src/InformationRegisters/__СоответствияОбъектовИБ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<InformationRegister>
		<Properties>
			<Name>__СоответствияОбъектовИБ</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Объект3</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>10</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТипСоответствия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.__ТипСоответствияОбъектовИБ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект1</Name>
					<Comment>Объект из сопряженной системы</Comment>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект2</Name>
					<Comment>Объект из базы УХ</Comment>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/CommonModules/__ОбщегоНазначенияПовтИсп/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Общего назначения (сервер): для серверных функций общего назначения
// с повторным использованием

#Область ПрограммныйИнтерфейс

// Возвращает значение предопределенного элемента ПВХ по имени.
//
// Параметры:
//  Имя - Строка - Имя переменной ПВХ.
// 
// Возвращаемое значение:
//  - ПроизвольныйТип - Значение переменной ПВХ.
//  - Массив - Массив значений переменной ПВХ.
// 
Функция ПолучитьПредопределенноеЗначение(Имя) Экспорт
	
	Возврат ПланыВидовХарактеристик.__ПредопределенныеЗначения.ПолучитьЗначение(Имя);
	
КонецФункции

// Возвращает соответствие предопределенных элементов ПВХ по имени.
//
// Параметры:
//  Имя - Строка - Имена переменных ПВХ, перечисленные через запятую.
//  ВРазрезеКлючей - Булево - Признак получения данных в виде соответствия, где Ключ - Имя переменной.
// 
// Возвращаемое значение:
//  - Соответствие - Соответствие имен и значений переменных ПВХ.
//  - Массив - Массив значений переменных ПВХ.
//
Функция ПолучитьПредопределенныеЗначения(Имена, ВРазрезеКлючей = Ложь) Экспорт
	
	Возврат ПланыВидовХарактеристик.__ПредопределенныеЗначения.ПолучитьЗначения(Имена, ВРазрезеКлючей);
	
КонецФункции

// Возвращает таблицу соответствий по отбору.
//
// Параметры:
//  ТипСоответствия - Перечисление.__ТипСоответствияОбъектовИБ - Тип соответствия.
//  Объект1 - ПроизвольныйТип - Объект1.
//  Объект2 - ПроизвольныйТип - Объект2.
//  Объект3 - ПроизвольныйТип - Объект3.
// 
// Возвращаемое значение:
//  - ТаблицаЗначений - Таблица соответствий по отбору.
// 
Функция ПолучитьСоответствиеОбъектовИБ(ТипСоответствия, Объект1 = Неопределено, Объект2 = Неопределено, Объект3 = Неопределено) Экспорт
	
	Возврат РегистрыСведений.__СоответствияОбъектовИБ.ПолучитьСоответствиеОбъектовИБ(ТипСоответствия, Объект1, Объект2, Объект3);
	
КонецФункции

#Область ПодпискиНаСобытияДокументов

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("ДокументОбъект.АвансовыйОтчет"), "АвансовыйОтчетПередЗаписью");
//
Функция ДокументыПередЗаписью() Экспорт
	
	Соответствие = Новый Соответствие;
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("ДокументОбъект.АвансовыйОтчет"), "АвансовыйОтчетПриЗаписи");
//
Функция ДокументыПриЗаписи() Экспорт
	
	Соответствие = Новый Соответствие;
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("ДокументОбъект.АвансовыйОтчет"), "АвансовыйОтчетОбработкаПроведения");
//
Функция ДокументыОбработкаПроведения() Экспорт
	
	Соответствие = Новый Соответствие;
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("ДокументОбъект.АвансовыйОтчет"), "АвансовыйОтчетОбработкаЗаполнения");
//
Функция ДокументыОбработкаЗаполнения() Экспорт
	
	Соответствие = Новый Соответствие;
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("ДокументОбъект.АвансовыйОтчет"), "АвансовыйОтчетПриКопировании");
//
Функция ДокументыПриКопировании() Экспорт
	
	Соответствие = Новый Соответствие;
	
	Возврат Соответствие;
	
КонецФункции

#КонецОбласти // ПодпискиНаСобытияДокументов

#Область ПодпискиНаСобытияСправочников

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("СправочникОбъект.Номенеклатура"), "НоменеклатураПередЗаписью");
//
Функция СправочникиПередЗаписью() Экспорт
	
	Соответствие = Новый Соответствие;
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("СправочникОбъект.Номенеклатура"), "НоменеклатураПриЗаписи");
//
Функция СправочникиПриЗаписи() Экспорт
	
	Соответствие = Новый Соответствие;
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("СправочникОбъект.Номенеклатура"), "НоменеклатураОбработкаЗаполнения");
//
Функция СправочникиОбработкаЗаполнения() Экспорт
	
	Соответствие = Новый Соответствие;
	
	Возврат Соответствие;
	
КонецФункции

// Определяет соответствие типа источника подписки и имени метода.
//
// Возвращаемое значение:
//   Соответствие - в качестве ключа передается тип объекта источника подписки,
// 					а в качестве значения имя исполняемого метода.
//
// Пример:
// Соответствие.Вставить(Тип("СправочникОбъект.Номенеклатура"), "НоменеклатураПриКопировании");
//
Функция СправочникиПриКопировании() Экспорт
	
	Соответствие = Новый Соответствие;
	
	Возврат Соответствие;
	
КонецФункции

#КонецОбласти // ПодпискиНаСобытияСправочников

#КонецОбласти // ПрограммныйИнтерфейс

#Область СлужебныеПроцедурыИФункции

#КонецОбласти // СлужебныеПроцедурыИФункции
